Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartOptimizeInvalidConnection Property
 No available couplings to connect standard lengths for this instance of straight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartOptimizeInvalidConnection { get; }
Public Shared ReadOnly Property FabricationPartOptimizeInvalidConnection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartOptimizeInvalidConnection {
	FailureDefinitionId^ get ();
}
static member FabricationPartOptimizeInvalidConnection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace